slowpoke/synthetic/fanout-w10-http-sync/microbench-bus-theory/fanout-w10-http-sync-service0-t8-c512-req20000-poker30000000-n2-rep1-flush-in-delay.log
[config.py] Random numbers for execution time: [457.8190171971569, 510.5244189842223, 569.5877680219319, 681.5840739845216, 759.3515679562805, 826.3618367022134, 909.8265613867029, 932.441954121777, 984.287486755421, 994.5039736858845, 1033.5791531668715]
benchmark                        : synthetic
num_threads                      : 8
num_conns                        : 512
target_service                   : service0
request_type                     : fanout-w10-http-sync
repetitions                      : 1
target_num_exp                   : 2
pre_run                          : False
num_req                          : 20000
groundtruths                     : []
slowdowns                        : []
predicteds                       : []
errs                             : []
client_cpu_quota                 : 2
random_seed                      : 29513
request_ratio                    : {'service0': 1, 'service1': 1, 'service2': 1, 'service3': 1, 'service4': 1, 'service5': 1, 'service6': 1, 'service7': 1, 'service8': 1, 'service9': 1, 'service10': 1}
baseline_service_processing_time : {'service0': 1033.58, 'service1': 994.5, 'service2': 984.29, 'service3': 932.44, 'service4': 909.83, 'service5': 826.36, 'service6': 759.35, 'service7': 681.58, 'service8': 569.59, 'service9': 510.52, 'service10': 457.82}
cpu_quota                        : {'service0': 2, 'service1': 2, 'service2': 2, 'service3': 2, 'service4': 2, 'service5': 2, 'service6': 2, 'service7': 2, 'service8': 2, 'service9': 2, 'service10': 2}
target_processing_time_range     : [0, 1033.58]
baseline_throughputs             : []
poker_batch                      : 30000000
[test.py] Starting experiment...
[test.py] >>>>>>>>>>>>>>>>>>>>>>>>>>>>> Running experiment 0...
[test.py] Actual processing time range: [0, 516]
[test.py] Running baseline experiment
    [exp] Running (pre_run: False) workload synthetic/fanout-w10-http-sync request with the following configuration: {'CLIENT_CPU_QUOTA': '2', 'SLOWPOKE_POKER_BATCH_THRESHOLD': '30000000', 'PROCESSING_TIME_SERVICE0': '0.00103358', 'PROCESSING_TIME_SERVICE1': '0.0009945', 'PROCESSING_TIME_SERVICE2': '0.00098429', 'PROCESSING_TIME_SERVICE3': '0.00093244', 'PROCESSING_TIME_SERVICE4': '0.00090983', 'PROCESSING_TIME_SERVICE5': '0.00082636', 'PROCESSING_TIME_SERVICE6': '0.00075935', 'PROCESSING_TIME_SERVICE7': '0.00068158', 'PROCESSING_TIME_SERVICE8': '0.00056959', 'PROCESSING_TIME_SERVICE9': '0.00051052', 'PROCESSING_TIME_SERVICE10': '0.00045782', 'SLOWPOKE_DELAY_MICROS_SERVICE0': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE1': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE2': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE3': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE4': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE5': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE6': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE7': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE8': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE9': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE10': '0.0'}
    [exp] Executing cmd `bash run.sh synthetic fanout-w10-http-sync 8 512 20000`:
        [run.sh] Running benchmark synthetic with request fanout-w10-http-sync, thread 8, conn 512, duration 60
        [run.sh] Deleting all services
        configmap "config-service0" deleted
        deployment.apps "service0" deleted
        service "service0" deleted
        configmap "config-service1" deleted
        deployment.apps "service1" deleted
        service "service1" deleted
        configmap "config-service10" deleted
        deployment.apps "service10" deleted
        service "service10" deleted
        configmap "config-service2" deleted
        deployment.apps "service2" deleted
        service "service2" deleted
        configmap "config-service3" deleted
        deployment.apps "service3" deleted
        service "service3" deleted
        configmap "config-service4" deleted
        deployment.apps "service4" deleted
        service "service4" deleted
        configmap "config-service5" deleted
        deployment.apps "service5" deleted
        service "service5" deleted
        configmap "config-service6" deleted
        deployment.apps "service6" deleted
        service "service6" deleted
        configmap "config-service7" deleted
        deployment.apps "service7" deleted
        service "service7" deleted
        configmap "config-service8" deleted
        deployment.apps "service8" deleted
        service "service8" deleted
        configmap "config-service9" deleted
        deployment.apps "service9" deleted
        service "service9" deleted
        deployment.apps "ubuntu-client" deleted
        [run.sh] Waiting for all pods to be deleted
        [run.sh] Deploying all services
        configmap/config-service0 created
        deployment.apps/service0 created
        service/service0 created
        configmap/config-service1 created
        deployment.apps/service1 created
        service/service1 created
        configmap/config-service10 created
        deployment.apps/service10 created
        service/service10 created
        configmap/config-service2 created
        deployment.apps/service2 created
        service/service2 created
        configmap/config-service3 created
        deployment.apps/service3 created
        service/service3 created
        configmap/config-service4 created
        deployment.apps/service4 created
        service/service4 created
        configmap/config-service5 created
        deployment.apps/service5 created
        service/service5 created
        configmap/config-service6 created
        deployment.apps/service6 created
        service/service6 created
        configmap/config-service7 created
        deployment.apps/service7 created
        service/service7 created
        configmap/config-service8 created
        deployment.apps/service8 created
        service/service8 created
        configmap/config-service9 created
        deployment.apps/service9 created
        service/service9 created
        [run.sh] Client pod not found, deploying client
        deployment.apps/ubuntu-client created
        [run.sh] Waiting for all pods to be running
        [run.sh] All pods are running
        [run.sh] Running warmup test
        [run.sh] /wrk/wrk -t8 -c512 -d3s -L http://service0:80/endpoint1
        Running 3s test @ http://service0:80/endpoint1
        8 threads and 512 connections
        Thread Stats   Avg      Stdev     Max   +/- Stdev
        Latency     1.05s   291.31ms   1.86s    66.75%
        Req/Sec    64.59     40.73   232.00     72.53%
        Latency Distribution
        50%    1.01s
        75%    1.28s
        90%    1.48s
        99%    1.66s
        1207 requests in 3.03s, 2.63MB read
        Socket errors: connect 0, read 0, write 0, timeout 1
        Requests/sec:    398.14
        Transfer/sec:      0.87MB
        [run.sh] Speed is 398.14, duration is 75
        [run.sh] Fix the request number.
        [run.sh] Running the actual test
        [run.sh] /wrk/wrk --timeout 20s -t8 -c512 -d75s -L -s /wrk/fix_req_n.lua http://service0:80/endpoint1
        [run.sh] Checking the resource usage
        Running 1m test @ http://service0:80/endpoint1
        8 threads and 512 connections
        Thread Stats   Avg      Stdev     Max   +/- Stdev
        Latency   793.76ms  234.77ms   1.74s    73.24%
        Req/Sec    82.06     41.66   250.00     64.16%
        Latency Distribution
        50%  700.75ms
        75%  962.41ms
        90%    1.15s
        99%    1.42s
        20000 requests in 1.25m, 43.60MB read
        Requests/sec:    266.67
        Transfer/sec:    595.31KB
        ------------------------------
        stop time: 31.313594
        stop time: 31.392650
        stop time: 31.372611
        stop time: 31.365546
        stop time: 31.277201
        stop time: 31.462224
        stop time: 31.328669
        stop time: 31.369246
        [run.sh] Test finished with status 0
        > STDERR
        > No resources found in default namespace.
        > error: metrics not available yet
    [exp] Times: [31.313594, 31.39265, 31.372611, 31.365546, 31.277201, 31.462224, 31.328669, 31.369246]
    [exp] Throughput: 637.750676323631
[test.py] Baseline throughput: 637.750676323631
[test.py] Running groundtruth experiment
    [exp] Running (pre_run: False) workload synthetic/fanout-w10-http-sync request with the following configuration: {'CLIENT_CPU_QUOTA': '2', 'SLOWPOKE_POKER_BATCH_THRESHOLD': '30000000', 'PROCESSING_TIME_SERVICE0': '0.0', 'PROCESSING_TIME_SERVICE1': '0.0009945', 'PROCESSING_TIME_SERVICE2': '0.00098429', 'PROCESSING_TIME_SERVICE3': '0.00093244', 'PROCESSING_TIME_SERVICE4': '0.00090983', 'PROCESSING_TIME_SERVICE5': '0.00082636', 'PROCESSING_TIME_SERVICE6': '0.00075935', 'PROCESSING_TIME_SERVICE7': '0.00068158', 'PROCESSING_TIME_SERVICE8': '0.00056959', 'PROCESSING_TIME_SERVICE9': '0.00051052', 'PROCESSING_TIME_SERVICE10': '0.00045782', 'SLOWPOKE_DELAY_MICROS_SERVICE0': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE1': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE2': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE3': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE4': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE5': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE6': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE7': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE8': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE9': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE10': '0.0'}
    [exp] Executing cmd `bash run.sh synthetic fanout-w10-http-sync 8 512 20000`:
        [run.sh] Running benchmark synthetic with request fanout-w10-http-sync, thread 8, conn 512, duration 60
        [run.sh] Deleting all services
        configmap "config-service0" deleted
        deployment.apps "service0" deleted
        service "service0" deleted
        configmap "config-service1" deleted
        deployment.apps "service1" deleted
        service "service1" deleted
        configmap "config-service10" deleted
        deployment.apps "service10" deleted
        service "service10" deleted
        configmap "config-service2" deleted
        deployment.apps "service2" deleted
        service "service2" deleted
        configmap "config-service3" deleted
        deployment.apps "service3" deleted
        service "service3" deleted
        configmap "config-service4" deleted
        deployment.apps "service4" deleted
        service "service4" deleted
        configmap "config-service5" deleted
        deployment.apps "service5" deleted
        service "service5" deleted
        configmap "config-service6" deleted
        deployment.apps "service6" deleted
        service "service6" deleted
        configmap "config-service7" deleted
        deployment.apps "service7" deleted
        service "service7" deleted
        configmap "config-service8" deleted
        deployment.apps "service8" deleted
        service "service8" deleted
        configmap "config-service9" deleted
        deployment.apps "service9" deleted
        service "service9" deleted
        deployment.apps "ubuntu-client" deleted
        [run.sh] Waiting for all pods to be deleted
        [run.sh] Deploying all services
        configmap/config-service0 created
        deployment.apps/service0 created
        service/service0 created
        configmap/config-service1 created
        deployment.apps/service1 created
        service/service1 created
        configmap/config-service10 created
        deployment.apps/service10 created
        service/service10 created
        configmap/config-service2 created
        deployment.apps/service2 created
        service/service2 created
        configmap/config-service3 created
        deployment.apps/service3 created
        service/service3 created
        configmap/config-service4 created
        deployment.apps/service4 created
        service/service4 created
        configmap/config-service5 created
        deployment.apps/service5 created
        service/service5 created
        configmap/config-service6 created
        deployment.apps/service6 created
        service/service6 created
        configmap/config-service7 created
        deployment.apps/service7 created
        service/service7 created
        configmap/config-service8 created
        deployment.apps/service8 created
        service/service8 created
        configmap/config-service9 created
        deployment.apps/service9 created
        service/service9 created
        [run.sh] Client pod not found, deploying client
        deployment.apps/ubuntu-client created
        [run.sh] Waiting for all pods to be running
        [run.sh] All pods are running
        [run.sh] Running warmup test
        [run.sh] /wrk/wrk -t8 -c512 -d3s -L http://service0:80/endpoint1
        Running 3s test @ http://service0:80/endpoint1
        8 threads and 512 connections
        Thread Stats   Avg      Stdev     Max   +/- Stdev
        Latency   718.86ms  198.00ms   1.40s    63.77%
        Req/Sec    88.06     53.63   292.00     73.68%
        Latency Distribution
        50%  709.50ms
        75%  866.08ms
        90%  974.24ms
        99%    1.18s
        1877 requests in 3.03s, 4.09MB read
        Requests/sec:    619.32
        Transfer/sec:      1.35MB
        [run.sh] Speed is 619.32, duration is 48
        [run.sh] Fix the request number.
        [run.sh] Running the actual test
        [run.sh] /wrk/wrk --timeout 20s -t8 -c512 -d48s -L -s /wrk/fix_req_n.lua http://service0:80/endpoint1
        [run.sh] Checking the resource usage
        NAME                             CPU(cores)   MEMORY(bytes)
        service0-65b756fc78-vvlk6        1666m        64Mi
        service1-fc9b56d49-kmcf4         543m         13Mi
        service10-78485db999-rk8bn       285m         11Mi
        service2-6b57f69dfb-5gjsl        599m         12Mi
        service3-5c6d85cdf9-p7cs9        611m         11Mi
        service4-5b94d69d86-qvnsm        512m         13Mi
        service5-569cbcbbd5-sbssn        466m         12Mi
        service6-7b8d48cf84-z88gf        441m         11Mi
        service7-59f655bcb7-56vz6        388m         13Mi
        service8-9bd49f55d-m2db7         358m         13Mi
        service9-7547cf678-ww9l6         300m         11Mi
        ubuntu-client-76886f6bbd-ckdl5   28m          16Mi
        Running 48s test @ http://service0:80/endpoint1
        8 threads and 512 connections
        Thread Stats   Avg      Stdev     Max   +/- Stdev
        Latency     1.53s     2.31s   10.51s    87.12%
        Req/Sec   105.53     55.13   430.00     71.61%
        Latency Distribution
        50%  660.25ms
        75%  878.89ms
        90%    5.22s
        99%   10.18s
        20000 requests in 48.00s, 43.60MB read
        Requests/sec:    416.67
        Transfer/sec:      0.91MB
        ------------------------------
        stop time: 33.995849
        stop time: 33.970256
        stop time: 33.996550
        stop time: 34.019532
        stop time: 33.978244
        stop time: 33.997382
        stop time: 34.031340
        stop time: 34.060058
        [run.sh] Test finished with status 0
        > STDERR
        > No resources found in default namespace.
    [exp] Times: [33.995849, 33.970256, 33.99655, 34.019532, 33.978244, 33.997382, 34.03134, 34.060058]
    [exp] Throughput: 588.1288881958933
    [exp] Running (pre_run: False) workload synthetic/fanout-w10-http-sync request with the following configuration: {'CLIENT_CPU_QUOTA': '2', 'SLOWPOKE_POKER_BATCH_THRESHOLD': '30000000', 'PROCESSING_TIME_SERVICE0': '0.000516', 'PROCESSING_TIME_SERVICE1': '0.0009945', 'PROCESSING_TIME_SERVICE2': '0.00098429', 'PROCESSING_TIME_SERVICE3': '0.00093244', 'PROCESSING_TIME_SERVICE4': '0.00090983', 'PROCESSING_TIME_SERVICE5': '0.00082636', 'PROCESSING_TIME_SERVICE6': '0.00075935', 'PROCESSING_TIME_SERVICE7': '0.00068158', 'PROCESSING_TIME_SERVICE8': '0.00056959', 'PROCESSING_TIME_SERVICE9': '0.00051052', 'PROCESSING_TIME_SERVICE10': '0.00045782', 'SLOWPOKE_DELAY_MICROS_SERVICE0': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE1': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE2': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE3': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE4': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE5': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE6': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE7': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE8': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE9': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE10': '0.0'}
    [exp] Executing cmd `bash run.sh synthetic fanout-w10-http-sync 8 512 20000`:
        [run.sh] Running benchmark synthetic with request fanout-w10-http-sync, thread 8, conn 512, duration 60
        [run.sh] Deleting all services
        configmap "config-service0" deleted
        deployment.apps "service0" deleted
        service "service0" deleted
        configmap "config-service1" deleted
        deployment.apps "service1" deleted
        service "service1" deleted
        configmap "config-service10" deleted
        deployment.apps "service10" deleted
        service "service10" deleted
        configmap "config-service2" deleted
        deployment.apps "service2" deleted
        service "service2" deleted
        configmap "config-service3" deleted
        deployment.apps "service3" deleted
        service "service3" deleted
        configmap "config-service4" deleted
        deployment.apps "service4" deleted
        service "service4" deleted
        configmap "config-service5" deleted
        deployment.apps "service5" deleted
        service "service5" deleted
        configmap "config-service6" deleted
        deployment.apps "service6" deleted
        service "service6" deleted
        configmap "config-service7" deleted
        deployment.apps "service7" deleted
        service "service7" deleted
        configmap "config-service8" deleted
        deployment.apps "service8" deleted
        service "service8" deleted
        configmap "config-service9" deleted
        deployment.apps "service9" deleted
        service "service9" deleted
        deployment.apps "ubuntu-client" deleted
        [run.sh] Waiting for all pods to be deleted
        [run.sh] Deploying all services
        configmap/config-service0 created
        deployment.apps/service0 created
        service/service0 created
        configmap/config-service1 created
        deployment.apps/service1 created
        service/service1 created
        configmap/config-service10 created
        deployment.apps/service10 created
        service/service10 created
        configmap/config-service2 created
        deployment.apps/service2 created
        service/service2 created
        configmap/config-service3 created
        deployment.apps/service3 created
        service/service3 created
        configmap/config-service4 created
        deployment.apps/service4 created
        service/service4 created
        configmap/config-service5 created
        deployment.apps/service5 created
        service/service5 created
        configmap/config-service6 created
        deployment.apps/service6 created
        service/service6 created
        configmap/config-service7 created
        deployment.apps/service7 created
        service/service7 created
        configmap/config-service8 created
        deployment.apps/service8 created
        service/service8 created
        configmap/config-service9 created
        deployment.apps/service9 created
        service/service9 created
        [run.sh] Client pod not found, deploying client
        deployment.apps/ubuntu-client created
        [run.sh] Waiting for all pods to be running
        [run.sh] All pods are running
        [run.sh] Running warmup test
        [run.sh] /wrk/wrk -t8 -c512 -d3s -L http://service0:80/endpoint1
        Running 3s test @ http://service0:80/endpoint1
        8 threads and 512 connections
        Thread Stats   Avg      Stdev     Max   +/- Stdev
        Latency   863.50ms  193.96ms   1.43s    67.73%
        Req/Sec    74.58     44.02   260.00     66.15%
        Latency Distribution
        50%  855.69ms
        75%  992.90ms
        90%    1.13s
        99%    1.30s
        1469 requests in 3.03s, 3.20MB read
        Requests/sec:    484.67
        Transfer/sec:      1.06MB
        [run.sh] Speed is 484.67, duration is 61
        [run.sh] Fix the request number.
        [run.sh] Running the actual test
        [run.sh] /wrk/wrk --timeout 20s -t8 -c512 -d61s -L -s /wrk/fix_req_n.lua http://service0:80/endpoint1
        [run.sh] Checking the resource usage
        NAME                             CPU(cores)   MEMORY(bytes)
        service0-65b756fc78-xhqs9        1903m        59Mi
        service1-fc9b56d49-fwrkw         1087m        12Mi
        service10-78485db999-z8nc9       610m         9Mi
        service2-6b57f69dfb-zlhgr        1074m        11Mi
        service3-5c6d85cdf9-nm6tr        1011m        9Mi
        service4-5b94d69d86-gpk4w        1001m        10Mi
        service5-569cbcbbd5-l9qp2        955m         10Mi
        service6-7b8d48cf84-d6xlk        870m         10Mi
        service7-59f655bcb7-p5tnz        846m         9Mi
        service8-9bd49f55d-m8gdv         740m         10Mi
        service9-7547cf678-sb5ds         655m         10Mi
        ubuntu-client-76886f6bbd-qplw4   37m          16Mi
        Running 1m test @ http://service0:80/endpoint1
        8 threads and 512 connections
        Thread Stats   Avg      Stdev     Max   +/- Stdev
        Latency   601.07ms  191.51ms   1.58s    78.54%
        Req/Sec   107.39     47.79   290.00     69.21%
        Latency Distribution
        50%  518.06ms
        75%  653.26ms
        90%  909.87ms
        99%    1.22s
        20000 requests in 1.02m, 43.60MB read
        Requests/sec:    327.87
        Transfer/sec:    731.94KB
        ------------------------------
        stop time: 23.689100
        stop time: 23.731813
        stop time: 23.729697
        stop time: 23.730330
        stop time: 23.723401
        stop time: 23.883422
        stop time: 23.797435
        stop time: 23.921159
        [run.sh] Test finished with status 0
        > STDERR
        > No resources found in default namespace.
    [exp] Times: [23.6891, 23.731813, 23.729697, 23.73033, 23.723401, 23.883422, 23.797435, 23.921159]
    [exp] Throughput: 841.1916537573978
[test.py] Running slowdown experiment
    [exp] Running (pre_run: False) workload synthetic/fanout-w10-http-sync request with the following configuration: {'CLIENT_CPU_QUOTA': '2', 'SLOWPOKE_POKER_BATCH_THRESHOLD': '30000000', 'PROCESSING_TIME_SERVICE0': '0.00103358', 'PROCESSING_TIME_SERVICE1': '0.0009945', 'PROCESSING_TIME_SERVICE2': '0.00098429', 'PROCESSING_TIME_SERVICE3': '0.00093244', 'PROCESSING_TIME_SERVICE4': '0.00090983', 'PROCESSING_TIME_SERVICE5': '0.00082636', 'PROCESSING_TIME_SERVICE6': '0.00075935', 'PROCESSING_TIME_SERVICE7': '0.00068158', 'PROCESSING_TIME_SERVICE8': '0.00056959', 'PROCESSING_TIME_SERVICE9': '0.00051052', 'PROCESSING_TIME_SERVICE10': '0.00045782', 'SLOWPOKE_DELAY_MICROS_SERVICE0': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE1': '516.5', 'SLOWPOKE_DELAY_MICROS_SERVICE2': '516.5', 'SLOWPOKE_DELAY_MICROS_SERVICE3': '516.5', 'SLOWPOKE_DELAY_MICROS_SERVICE4': '516.5', 'SLOWPOKE_DELAY_MICROS_SERVICE5': '516.5', 'SLOWPOKE_DELAY_MICROS_SERVICE6': '516.5', 'SLOWPOKE_DELAY_MICROS_SERVICE7': '516.5', 'SLOWPOKE_DELAY_MICROS_SERVICE8': '516.5', 'SLOWPOKE_DELAY_MICROS_SERVICE9': '516.5', 'SLOWPOKE_DELAY_MICROS_SERVICE10': '516.5'}
    [exp] Executing cmd `bash run.sh synthetic fanout-w10-http-sync 8 512 20000`:
        [run.sh] Running benchmark synthetic with request fanout-w10-http-sync, thread 8, conn 512, duration 60
        [run.sh] Deleting all services
        configmap "config-service0" deleted
        deployment.apps "service0" deleted
        service "service0" deleted
        configmap "config-service1" deleted
        deployment.apps "service1" deleted
        service "service1" deleted
        configmap "config-service10" deleted
        deployment.apps "service10" deleted
        service "service10" deleted
        configmap "config-service2" deleted
        deployment.apps "service2" deleted
        service "service2" deleted
        configmap "config-service3" deleted
        deployment.apps "service3" deleted
        service "service3" deleted
        configmap "config-service4" deleted
        deployment.apps "service4" deleted
        service "service4" deleted
        configmap "config-service5" deleted
        deployment.apps "service5" deleted
        service "service5" deleted
        configmap "config-service6" deleted
        deployment.apps "service6" deleted
        service "service6" deleted
        configmap "config-service7" deleted
        deployment.apps "service7" deleted
        service "service7" deleted
        configmap "config-service8" deleted
        deployment.apps "service8" deleted
        service "service8" deleted
        configmap "config-service9" deleted
        deployment.apps "service9" deleted
        service "service9" deleted
        deployment.apps "ubuntu-client" deleted
        [run.sh] Waiting for all pods to be deleted
        [run.sh] Deploying all services
        configmap/config-service0 created
        deployment.apps/service0 created
        service/service0 created
        configmap/config-service1 created
        deployment.apps/service1 created
        service/service1 created
        configmap/config-service10 created
        deployment.apps/service10 created
        service/service10 created
        configmap/config-service2 created
        deployment.apps/service2 created
        service/service2 created
        configmap/config-service3 created
        deployment.apps/service3 created
        service/service3 created
        configmap/config-service4 created
        deployment.apps/service4 created
        service/service4 created
        configmap/config-service5 created
        deployment.apps/service5 created
        service/service5 created
        configmap/config-service6 created
        deployment.apps/service6 created
        service/service6 created
        configmap/config-service7 created
        deployment.apps/service7 created
        service/service7 created
        configmap/config-service8 created
        deployment.apps/service8 created
        service/service8 created
        configmap/config-service9 created
        deployment.apps/service9 created
        service/service9 created
        [run.sh] Client pod not found, deploying client
        deployment.apps/ubuntu-client created
        [run.sh] Waiting for all pods to be running
        [run.sh] All pods are running
        [run.sh] Running warmup test
        [run.sh] /wrk/wrk -t8 -c512 -d3s -L http://service0:80/endpoint1
        Running 3s test @ http://service0:80/endpoint1
        8 threads and 512 connections
        Thread Stats   Avg      Stdev     Max   +/- Stdev
        Latency     1.02s   284.58ms   1.96s    68.59%
        Req/Sec    66.27     44.17   212.00     66.84%
        Latency Distribution
        50%  989.00ms
        75%    1.17s
        90%    1.46s
        99%    1.84s
        1315 requests in 3.03s, 2.87MB read
        Requests/sec:    434.41
        Transfer/sec:      0.95MB
        [run.sh] Speed is 434.41, duration is 69
        [run.sh] Fix the request number.
        [run.sh] Running the actual test
        [run.sh] /wrk/wrk --timeout 20s -t8 -c512 -d69s -L -s /wrk/fix_req_n.lua http://service0:80/endpoint1
        [run.sh] Checking the resource usage
        NAME                             CPU(cores)   MEMORY(bytes)
        service0-65b756fc78-l8nk4        860m         66Mi
        service1-55d995b5f4-584xl        147m         14Mi
        service10-5bbc7c9646-m45ck       347m         12Mi
        service2-8455cb658c-lldc7        145m         13Mi
        service3-7bd94467bd-ttppv        566m         13Mi
        service4-5c9457f55c-2l597        601m         13Mi
        service5-74dff8b46b-j699p        99m          14Mi
        service6-56c56d699-tgjb4         514m         13Mi
        service7-5fb9bc4bd-2jd7d         101m         13Mi
        service8-8457fc844f-lfpzf        93m          13Mi
        service9-7f8d58d4f5-wwpt6        382m         11Mi
        ubuntu-client-76886f6bbd-rwhd7   14m          18Mi
        Running 1m test @ http://service0:80/endpoint1
        8 threads and 512 connections
        Thread Stats   Avg      Stdev     Max   +/- Stdev
        Latency     2.77s     2.46s   10.94s    78.45%
        Req/Sec    72.37     43.67   262.00     69.00%
        Latency Distribution
        50%    1.27s
        75%    4.15s
        90%    5.76s
        99%   10.52s
        14988 requests in 1.15m, 32.68MB read
        Requests/sec:    216.95
        Transfer/sec:    484.33KB
        ------------------------------
        [run.sh] Test finished with status 1
        > STDERR
        > No resources found in default namespace.
        > PANIC: unprotected error in call to Lua API (/wrk/fix_req_n.lua:32: bad argument #1 to 'format' (number expected, got nil))
        > command terminated with exit code 1
    [exp] Error running bash run.sh synthetic fanout-w10-http-sync 8 512 20000
[test.py] Found 0 throughput, rerun experiment
    [exp] Running (pre_run: False) workload synthetic/fanout-w10-http-sync request with the following configuration: {'CLIENT_CPU_QUOTA': '2', 'SLOWPOKE_POKER_BATCH_THRESHOLD': '30000000', 'PROCESSING_TIME_SERVICE0': '0.00103358', 'PROCESSING_TIME_SERVICE1': '0.0009945', 'PROCESSING_TIME_SERVICE2': '0.00098429', 'PROCESSING_TIME_SERVICE3': '0.00093244', 'PROCESSING_TIME_SERVICE4': '0.00090983', 'PROCESSING_TIME_SERVICE5': '0.00082636', 'PROCESSING_TIME_SERVICE6': '0.00075935', 'PROCESSING_TIME_SERVICE7': '0.00068158', 'PROCESSING_TIME_SERVICE8': '0.00056959', 'PROCESSING_TIME_SERVICE9': '0.00051052', 'PROCESSING_TIME_SERVICE10': '0.00045782', 'SLOWPOKE_DELAY_MICROS_SERVICE0': '0.0', 'SLOWPOKE_DELAY_MICROS_SERVICE1': '516.5', 'SLOWPOKE_DELAY_MICROS_SERVICE2': '516.5', 'SLOWPOKE_DELAY_MICROS_SERVICE3': '516.5', 'SLOWPOKE_DELAY_MICROS_SERVICE4': '516.5', 'SLOWPOKE_DELAY_MICROS_SERVICE5': '516.5', 'SLOWPOKE_DELAY_MICROS_SERVICE6': '516.5', 'SLOWPOKE_DELAY_MICROS_SERVICE7': '516.5', 'SLOWPOKE_DELAY_MICROS_SERVICE8': '516.5', 'SLOWPOKE_DELAY_MICROS_SERVICE9': '516.5', 'SLOWPOKE_DELAY_MICROS_SERVICE10': '516.5'}
    [exp] Executing cmd `bash run.sh synthetic fanout-w10-http-sync 8 512 20000`:
        [run.sh] Running benchmark synthetic with request fanout-w10-http-sync, thread 8, conn 512, duration 60
        [run.sh] Deleting all services
        configmap "config-service0" deleted
        deployment.apps "service0" deleted
        service "service0" deleted
        configmap "config-service1" deleted
        deployment.apps "service1" deleted
        service "service1" deleted
        configmap "config-service10" deleted
        deployment.apps "service10" deleted
        service "service10" deleted
        configmap "config-service2" deleted
        deployment.apps "service2" deleted
        service "service2" deleted
        configmap "config-service3" deleted
        deployment.apps "service3" deleted
        service "service3" deleted
        configmap "config-service4" deleted
        deployment.apps "service4" deleted
        service "service4" deleted
        configmap "config-service5" deleted
        deployment.apps "service5" deleted
        service "service5" deleted
        configmap "config-service6" deleted
        deployment.apps "service6" deleted
        service "service6" deleted
        configmap "config-service7" deleted
        deployment.apps "service7" deleted
        service "service7" deleted
        configmap "config-service8" deleted
        deployment.apps "service8" deleted
        service "service8" deleted
        configmap "config-service9" deleted
        deployment.apps "service9" deleted
        service "service9" deleted
        deployment.apps "ubuntu-client" deleted
        [run.sh] Waiting for all pods to be deleted